#=============================================================
# евклидово расстояние
#=============================================================
def euclidean_distance(v1, v2):
    return sum((x - y) ** 2 for x, y in zip(v1, v2)) ** 0.5
 
#=============================================================
# манхэттенское расстояние
#=============================================================
def manhattan_distance(v1, v2):
    return sum((x - y) for (x, y) in zip(v1, v2))


print(manhattan_distance((2,2),(5,6)))